#  1 Дан многомерный список. Вывести на экран первый и последний столбцы.


A = [
    [1, 6, 8, 5, 4, 0, 3],

    [5, 7, 8, 9, 4, 2, 1],

    [6, 0, 7, 8, 1, 2, 5],

    [5, 7, 2, 7, 5, 2, 1]
]

for row in A:
   print(row[0], end = '\n')

for row in A:
   print(row[len(row) - 1], end='\n')




